# Введення параметрів
a = input("Введіть час засідання (наприклад, 12:30): ")
b = input("Введіть назву проблеми: ")
c = input("Введіть організацію: ")
d = int(input("Введіть кількість заявок: "))
e = float(input("Введіть загальну суму (в тисячах гривень): "))
g = round(e / d, 2)

# Форматування з оператором %
print("\nОператор %:")
print("Сьогодні в \"%s\" буде проходити позачергове засідання комітету з проблем \"%s\", організоване \"%s\". "
      "Було подано \"%d\" заявок на загальну суму \"%.2f\" тис. гривень. Середня вартість проекту склала \"%.2f\" гривень." % (a, b, c, d, e, g))

# Форматування з методом format()
print("\nМетод format():")
print("Сьогодні в \"{}\" буде проходити позачергове засідання комітету з проблем \"{}\", організоване \"{}\". "
      "Було подано \"{}\" заявок на загальну суму \"{:.2f}\" тис. гривень. Середня вартість проекту склала \"{:.2f}\" гривень.".format(a, b, c, d, e, g))

# Форматування з використанням f-строк
print("\nF-строки:")
print(f"Сьогодні в \"{a}\" буде проходити позачергове засідання комітету з проблем \"{b}\", організоване \"{c}\". "
      f"Було подано \"{d}\" заявок на загальну суму \"{e:.2f}\" тис. гривень. Середня вартість проекту склала \"{g:.2f}\" гривень.")
